car-rental-ci/app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `phone`, `user_type`, `created_at`, `updated_at`) VALUES ('Pokie', 'pokie23@gmail.com', '$2y$10$bXMATGGZxTfsbFwLJAZ97O1hgD4ksvZbgzrsFRy7N7fj6Qapp9a/e', '0912312312', 'customer', '2025-10-21 18:03:31', '2025-10-21 18:03:31')
---
    public function createAccount()
    {
        $userModel = new UserModel();
        $rules = [
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[password]',
            'phone' => 'permit_empty|numeric'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('/auth/register')->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'phone' => $this->request->getPost('phone'),
            'user_type' => 'customer' // Default user type
        ];

        $userModel->insert($data);