car-rental-ci/app/Controllers/Customer.php

    public function bookCar($carId)
    {
        // Check if user is logged in and is customer
        if (!$this->session->has('logged_in') || $this->session->get('user_type') !== 'customer') {
            return redirect()->to('/auth/login');
        }

        $carModel = new CarModel();
        $car = $carModel->find($carId);
---
SELECT *
FROM `cars`
WHERE `cars`.`id` = '1'

    public function createBooking()
    {
        // Check if user is logged in and is customer
        if (!$this->session->has('logged_in') || $this->session->get('user_type') !== 'customer') {
            return redirect()->to('/auth/login');
        }

        $carModel = new CarModel();
        $bookingModel = new BookingModel();

        $carId = $this->request->getPost('car_id');
        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        $car = $carModel->find($carId);
---
SELECT *
FROM `cars`
WHERE `cars`.`id` = '1'

            'total_price' => $totalPrice
        ];

        if ($bookingModel->insert($data)) {
            // Update car status
            $carModel->update($carId, ['status' => 'reserved']);
---
INSERT INTO `bookings` (`user_id`, `car_id`, `start_date`, `end_date`, `status`, `total_price`, `created_at`, `updated_at`) VALUES ('7', '1', '2025-10-21', '2025-10-22', 'pending', 11000, '2025-10-21 23:10:51', '2025-10-21 23:10:51')
UPDATE `cars` SET `status` = 'reserved', `updated_at` = '2025-10-21 23:10:51'
WHERE `cars`.`id` IN ('1')