car-rental-ci/app/Models/BookingModel.php

SELECT `bookings`.*, `cars`.`name` as `car_name`, `cars`.`plate`, `cars`.`image`
FROM `bookings`
JOIN `cars` ON `cars`.`id` = `bookings`.`car_id`
WHERE `bookings`.`user_id` = '7'
ORDER BY `bookings`.`created_at` DESC
---
    public function getUserBookings($userId)
    {
        return $this->select('bookings.*, cars.name as car_name, cars.plate, cars.image_url, cars.model as car_model, cars.price_per_day')
                    ->join('cars', 'cars.id = bookings.car_id')
                    ->where('bookings.user_id', $userId)
                    ->orderBy('bookings.created_at', 'DESC')
                    ->findAll();