car-rental-ci/app/Models/CarModel.php

    public function getAvailableCars()
    {
        return $this->where('status', 'available')
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `cars`
WHERE `status` = 'available'
ORDER BY `created_at` DESC