car-rental-ci/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function authenticate($email, $password)
    {
        $user = $this->where('email', $email)->first();